app/controllers/api/sessions_controller.rb

  def create
    @user = User.find_by_credentials(params[:user][:email], params[:user][:password])
    if @user.save
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "KoWnOXmBRNQs7ahkGqd7rQ"], ["updated_at", "2019-02-27 19:00:19.643457"], ["id", 1]]